Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: ཤར་ཕྱོགས་དམའ་ན་ནུབ་ཕྱོགས་མཐོ། ནུབ་ཕྱོགས་དམའ་ན་ཤར་ཕྱོགས་མཐོ། །བྱང་ཕྱོགས་དམའ་ན་ལྷོ་ཕྱོགས་མཐོ། །ལྷོ་ཕྱོགས་དམའ་ན་བྱང་ཕྱོགས་མཐོ། །མཐའ་དམའ་ན་དབུས་མཐོ།
en: The east sank and the west rose, the west sank and the east rose, the north sank and the south rose, the south sank and the north rose, the perimeter sank and the center rose, and the center sank and the perimeter rose.

source: །དབུས་དམའ་ན་མཐའ་མཐོ་སྟེ། ཚད་མེད་པའི་སྣང་བ་འཇིག་རྟེན་དུ་བྱུང་ནས་འཇིག་རྟེན་གྱི་བར་མུན་ནག་སྨག་ཏུ་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ཀྱང་སྣང་བ་དེས་གསལ་བར་གྱུར་ཏོ།
en: An immeasurable radiance shone in the universe so that whatever darkness there was between the worlds was illuminated by it.

source: །སེམས་ཅན་གང་དག་དེར་སྐྱེས་པ་དེ་དག་གཅིག་གིས་གཅིག་ཤེས་པར་གྱུར་ཏེ།
en: The beings who were born there could see each other and they cried, “Ah!

source: འདི་སྐད་དུ་ཀྱེ་སེམས་ཅན་གཞན་དག་ཀྱང་འདིར་སྐྱེས་པར་གྱུར་ཏོ་ཞེས་འཛེར་ཏེ། མནར་མེད་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་བར་དུ་ཡང་དེ་བཞིན་ནོ།
en: Other beings have been born here too!” This occurred even as far down as the great Avīci hell.

source: །གླེང་གཞིའི་ལེའུ་སྟེ་དང་པོའོ།། །།
en: Conclusion of the first chapter: “The Introduction.”

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་ངས་དྲན་པ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ཏེ།
en: Śālendrarāja Chapter 2 Then the Bhagavān said to the youth Candraprabha, “Young man, I remember that in the past, when I was practicing the conduct of a bodhisattva, I became a cakravartin.

source: །ཏིང་ངེ་འཛིན་འདི་འདོད་ཅིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་འདི་ཉིད་ལ་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གྲངས་མེད་དཔག་ཏུ་མེད་པ་རྣམས་ལ་ངས་རིན་པོ་ཆེ་ཐམས་ཅད་དང་མེ་ཏོག་དང་སྤོས་དང་དྲི་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་དང་སིལ་སྙན་དང་ཕེག་རྡོབ་པ་དང་རྣམ་པར་རྒྱལ་བའི་བ་དན་དང་རིན་པོ་ཆེའི་གཙུག་ལག་ཁང་རྣམ་པ་སྣ་ཚོགས་རྣམ་པར་བཀྲ་བ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱ་སྟོང་དུ་མའི་བཀོད་པ་ཐམས་ཅད་ཀྱིས་བཀུར་སྟིར་བྱས་བླ་མར་བྱས་རི་མོར་བྱས་མཆོད་པར་བྱས་རྗེད་པར་བྱས་གསོལ་བར་བྱས་ཏེ།
en: I desired this samādhi and I desired to attain quickly the highest, complete enlightenment of perfect buddhahood. For many hundred thousand quintillions of eons on this Vulture Peak Mountain I served, venerated, revered, honored, worshiped, and made offerings to many countless, innumerable tathāgatas, arhats, perfectly enlightened buddhas with the presentation of many hundred thousand quintillions of every kind of jewel, and various kinds of beautiful flowers, incense, perfume, garlands, ointments, powders, parasols, banners, flags, music, musical instruments, flags of victory, and precious monasteries.

source: གཞོན་ནུ་ངས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་རྒྱས་པར་ཐོས་ཏེ། བཟུང་ངོ་། །དྲིས་སོ། །བཅངས་སོ།
en: “Young man, I heard from those tathāgatas extensively the samādhi, the revealed equality of the nature of all phenomena.

source: །བཀླགས་སོ། །རབ་ཏུ་བཏོན་ཏོ། །ཉོན་མོངས་པ་མེད་པའི་སྒོམ་པས་བསྒོམས་སོ། །མང་དུ་བྱས་ཤིང་གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: I obtained it, asked questions about it, preserved it, recited it to others, promoted it, meditated on it with an unadulterated meditation, promulgated it, and made it widely known to others.

source: །གཞོན་ནུ་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཐ་མ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སཱ་ལའི་དབང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: “Young man, the last of all those tathāgatas was the Tathāgata, the arhat, the perfectly enlightened Buddha Śālendrarāja.

source: གཞོན་ནུ་དེ་བཞིན་གཤེགས་པ་སཱ་ལའི་དབང་པོའི་རྒྱལ་པོ་དེའི་ཉན་ཐོས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་དགེ་འདུན་བྱུང་སྟེ།
en: Young man, that Tathāgata Śālendrarāja had a saṅgha of a thousand trillion śrāvakas and bodhisattvas.

source: དེ་དག་གི་ཚེའི་ཚད་ནི་ལོ་འབུམ་ཕྲག་བདུན་ཅུ་རྩ་དྲུག་ཏུ་གྱུར་ཏོ།
en: Their lifespans were seven million, six hundred thousand years.

source: །གཞོན་ནུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སཱ་ལའི་དབང་པོའི་རྒྱལ་པོ་དེ་ལ་ངས་ལོ་བྱེ་བ་སྟོང་ཕྲག་བཅྭ་བརྒྱད་དུ་མཆོད་པ་དང་རིམ་གྲོ་བྱས་ཏེ་ལྷའི་ཙན་དན་དང་རིན་པོ་ཆེའི་གཙུག་ལག་ཁང་བྱེ་བ་བྱས་སོ།
en: I served and made offerings to the Tathāgata, the arhat, the perfectly enlightened Buddha Śālendrarāja for a hundred and eighty thousand million years and I built ten million monasteries made of sandalwood and precious materials.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སཱ་ལའི་དབང་པོའི་རྒྱལ་པོ་དེའི་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་དྲུག་ཏུ་གྱུར་ཏེ།
en: The Tathāgata, the arhat, the perfectly enlightened Buddha Śālendrarāja’s lifespan was seven hundred and sixty thousand million years.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སཱ་ལའི་དབང་པོའི་རྒྱལ་པོ་དེའི་དྲུང་དུ་ང་རབ་ཏུ་བྱུང་ནས་ལོ་བྱེ་བ་སྟོང་ཕྲག་བཅུ་བཞིར་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་མཉན་ཅིང་བཟུང་སྟེ་དྲིས་སོ།
en: I entered homelessness in the presence of the Tathāgata, the arhat, the perfectly enlightened Buddha Śālendrarāja and for a hundred and forty thousand million years I listened to the samādhi, the revealed equality of the nature of all phenomena.

source: །བཅངས་སོ། །བཀླགས་སོ། །རབ་ཏུ་བཏོན་ཏོ། །ཉོན་མོངས་པ་མེད་པའི་སྒོམ་པས་བསྒོམས་སོ། །མང་དུ་བྱས་ཤིང་གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: I obtained it, asked questions about it, preserved it, recited it to others, promoted it, meditated on it with an unadulterated meditation, promulgated it, and made it widely known to others.”

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་ཏིང་ངེ་འཛིན་འདི་འདོད་ཅིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་ན་ཁྱོད་ཀྱིས་ཀྱང་ང་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པ་དང་རིམ་གྲོ་དང་གཡོག་བྱ་བ་ལ་བརྩོན་པར་བྱའོ།
en: Then the Bhagavān said to the youth Candraprabha, “Young man, if in that way you wish for this samādhi and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, then you too should dedicate yourself to making offerings to, serving, and being an attendant to all tathāgatas as I have done.

source: །གཞོན་ནུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Young man, why is that?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པ་དང་རིམ་གྲོ་དང་གཡོག་བྱས་པའི་རྒྱུ་འཐུན་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་རྙེད་པར་དཀའ་བ་མ་ཡིན་ན་ཏིང་ངེ་འཛིན་འདི་ལྟ་ཅི་སྨོས།
en: The natural result of making offerings to, serving, and being an attendant to all tathāgatas is that it will not be difficult for the bodhisattva mahāsattvas to attain the highest, complete enlightenment of perfect buddhahood, let alone this samādhi, as their natural result.

source: གཞོན་ནུ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པ་དང་རིམ་གྲོ་དང་གཡོག་བྱས་པ་ལ་རྟག་ཏུ་ཡིད་ཡོངས་སུ་མི་སྐྱོ་བར་བྱའོ།
en: “Young man, in that way you should never weary of making offerings to, serving, and being an attendant to all tathāgatas.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་སྔོན་བྱུང་བའི་ལེའུ་འདི་ཉིད་རྒྱས་པར་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: Then the Bhagavān taught extensively, as a praise in chanted verses, this chapter on the past lives of the youth Candraprabha:

source: །དྲན་པ་སྟོབས་བཅུ་བྱེ་བ་དྲུག་ཅུ་དག །སྔོན་ཚེ་བྱ་རྒོད་ཕུང་པོའི་རི་ལ་བཞུགས།
en: “I remember six hundred million of those who have the ten strengths, Dwelling on Vulture Peak Mountain in the past

source: །ང་སྔོན་བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པའི་ཚེ།
en: Who taught me, when I was practicing bodhisattva conduct,

source: །ཏིང་འཛིན་ཞི་བའི་མཆོག་འདི་བཤད་བྱས་ཏེ།
en: This supreme peace of samādhi. {1}

source: །དེ་དག་གི་ཡང་ཐ་མ་ནི།
en: “The last of all of them

source: །འཇིག་རྟེན་མགོན་པོ་འོད་བྱེད་པ།
en: Was the Lord of the World, the illuminator

source: །སཱ་ལའི་དབང་རྒྱལ་ཞེས་བྱ་སྟེ།
en: Named Śālendrarāja,

source: དེ་ལ་ང་ཡིས་ཡོངས་སུ་དྲིས།
en: And I asked him questions. {2}

source: །ང་ཡང་རྒྱལ་རིགས་ཉིད་གྱུར་ཏེ།
en: “I had become of royal caste.

source: །རྒྱལ་པོ་ས་བདག་གཙོ་བོ་ཡིན།
en: I was the principal king, the sovereign.

source: །ང་ཡི་བུ་ཡང་ལྔ་བརྒྱ་སྟེ། དེ་དག་ལས་ནི་མི་ཉུང་བྱུང་།
en: I had five hundred sons, No less indeed than that. {3}

source: །སངས་རྒྱས་དེ་ཡི་གཙུག་ལག་ཁང་།
en: “For that buddha I built Ten million monasteries

source: །ཙན་དན་ཁྱད་པར་ཅན་རྣམས་དང་། །ཁ་ཅིག་རིན་ཆེན་བརྩེགས་པ་ཡི།
en: Made of special sandalwood, And some of precious materials. {4}

source: །བྱེ་བ་སྙེད་ནི་ངས་བྱས་ཏེ།
en: “I was a king named Bhīṣmottara,

source: །སྐྱེ་བོ་མང་པོ་དགའ་ཞིང་ཡིད་འོང་བ། །འཇིགས་པའི་བླ་མ་ཞེས་བྱ་རྒྱལ་པོར་གྱུར།
en: Beloved and adored by many beings.

source: །སངས་རྒྱས་ལ་ནི་མཆོད་པ་དམ་པ་དག །ལོ་སྟོང་བྱེ་བ་བཅྭ་བརྒྱད་བར་དུ་བྱས།
en: For a hundred and eighty thousand million years I made excellent offerings to that buddha. {5}

source: །རྣམ་པར་འདྲེན་པ་སཱ་ལའི་དབང་པོ་རྒྱལ།
en: “The lifespan of the guide Śālendrarāja,

source: །རྐང་གཉིས་གཙོ་བོ་རྒྱལ་བ་མ་སྨད་པ།
en: That jina, irreproachable,

source: །དེ་ཡི་དུས་ན་དེ་ཡི་ཚེ་ཚད་ནི།
en: Supreme among humans,

source: །ལོ་བྱེ་སྟོང་ཕྲག་བདུན་ཅུ་དྲུག་ཏུ་གྱུར།
en: Was seven hundred and sixty thousand million years. {6} “The saṅgha of that supreme man

source: །ཉན་ཐོས་མཚུངས་པ་ཁྲག་ཁྲིག་བརྒྱད་ཅུ་སྟེ།
en: Was composed of eight trillion śrāvakas

source: །གསུམ་རིག་མངོན་ཤེས་དྲུག་ལྡན་དབང་པོ་ཐུལ།
en: Who had the three knowledges, the six higher cognitions, and controlled senses,

source: །ཟག་པ་ཟད་ཅིང་ཐ་མའི་ལུས་འཛིན་པ།
en: Whose defilements had ceased, and who were in their last body. {7}

source: །དེ་ཚེ་མི་མཆོག་གི་ནི་དགེ་འདུན་བྱུང་།
en: “At that time I always longed for this samādhi

source: །ལྷར་བཅས་འཇིག་རྟེན་དག་ལ་ཕན་པའི་ཕྱིར། །དེ་ཚེ་ཏིང་འཛིན་འདི་ནི་བདག་འདོད་པས། །རྒྱལ་བ་རྐང་གཉིས་གཙོ་བོ་དེ་དག་ལ།
en: In order to benefit the people of the world and the devas,

source: །མཆོད་པ་རྣམ་པ་མང་པོ་ངས་བྱས་ཏེ།
en: And so I made many kinds of offerings

source: རྒྱལ་བ་སཱ་ལའི་དབང་རྒྱལ་དྲུང་དུ་ཡང་། །ང་ནི་བཙུན་མོ་སྲས་བཅས་རབ་ཏུ་བྱུང་།
en: To that jina, that supreme human. {8} “I, with my sons and wives, entered homelessness In the presence of Jina Śālendrarāja And I asked questions about this samādhi for

source: །ལོ་ཡང་བྱེ་བ་སྟོང་ཕྲག་བཅུ་བཞིར་ནི།
en: A hundred and forty thousand million years. {9} “I acquired from that sugata

source: །ཏིང་ངེ་འཛིན་འདི་ངས་ཀྱང་ཡོངས་དྲིས་ཏེ།
en: The single chapter of this samādhi,

source: །ཚིགས་བཅད་ཁྲག་ཁྲིག་སྟོང་ཕྲག་བརྒྱད་ཅུ་དང་། །གཞན་ཡང་དཀྲིགས་ཕྲག་བྱེ་བ་བརྒྱ་རྣམས་ནི། །ཏིང་འཛིན་འདི་ཉིད་ཀྱི་ནི་ལེའུ་གཅིག་པོ།
en: Which has eight thousand trillion verses

source: །ངས་ནི་བདེ་བར་གཤེགས་པ་དེ་ལས་བླངས།
en: And moreover another hundred septillion. {10}

source: །ཏིང་འཛིན་དམ་པ་འདི་ནི་འདོད་པའི་ཕྱིར།
en: “Because I longed for this sublime samādhi There was nothing that I had not previously offered:

source: །མགོ་དང་རྐང་ལག་ཆུང་མ་དེ་བཞིན་བུ།
en: Heads, hands, legs, wives and likewise sons,

source: །རིན་ཆེན་མང་པོ་དེ་བཞིན་བཟའ་བཅའ་རྣམས།
en: An abundance of riches, and similarly food to eat. {11}

source: །སྔོན་ཆད་ངས་ནི་མ་བཏང་ཆུང་ཟད་མེད།
en: “I remember ten thousand million buddhas

source: །སངས་རྒྱས་དག་ནི་བྱེ་བ་ཕྲག་སྟོང་དང་། །དེ་ལས་ལྷག་པར་གང་གཱའི་བྱེ་མ་སྙེད།
en: And more, to the number of sand grains in the Ganges,

source: །གང་དག་བྱ་རྒོད་ཕུང་པོ་འདིར་བཞུགས་ནས།
en: Residing on Vulture Peak Mountain

source: །ཏིང་འཛིན་ཞི་མཆོག་འདི་སྟོན་ངས་དྲན་ཏེ།
en: And teaching this supreme samādhi, this peace. {12}

source: །དེ་ཀུན་མཚན་ཀྱང་ཤཱཀྱ་ཁྱུ་མཆོག་ཡིན།
en: “All of them had the name Śākyaṛṣabha.

source: །ཀུན་གྱི་སྲས་ཀྱང་དགྲ་གཅན་ཟིན་ཅེས་བྱ།
en: All of their sons were named Rāhula.

source: །ཞབས་འབྲིང་བ་ཡི་མིང་ཡང་ཀུན་དགའ་བོ།
en: All their attendants were named Ānanda.

source: །སེར་སྐྱའི་གྲོང་ནས་ཐམས་ཅད་རབ་ཏུ་བྱུང་།
en: All were mendicants from places named Kapilavastu. {13}

source: །འཕྲུལ་མཆོག་ཤཱ་རིའི་བུ་དང་པང་ནས་སྐྱེས།
en: “Their principal two students were Kolita and Śāriputra,

source: །སྐྱོབ་པ་ཀུན་ཀྱང་མཚན་ནི་འཐུན་པར་གྱུར།
en: The names of all the saviors were the same,

source: །དེ་ཚེ་འཇིག་རྟེན་ཁམས་ཀྱང་མིང་འདྲ་སྟེ།
en: The names of their worlds were the same,

source: །ཐམས་ཅད་ཀྱང་ནི་སྙིགས་མའི་དུས་སུ་བྱུང་།
en: And they all appeared in a time of degeneration. {14}

source: །བྱང་ཆུབ་སྤྱད་པ་འདི་ནི་སྤྱོད་པའི་ཚེ།
en: “While I practiced this bodhisattva conduct,

source: །མི་དབང་དེ་ཀུན་ང་ཡིས་བཀུར་སྟིར་བྱས།
en: I honored all those lords of men.

source: །ཏིང་འཛིན་འདི་ནི་ཡོངས་སུ་ཚོལ་བའི་ཚེ།
en: While I longed for this samādhi,

source: །རྒྱལ་ལ་མཆོད་པ་མ་བྱས་ཅི་ཡང་མེད།
en: There was nothing I did not offer to the jinas. {15}

source: །ནན་ཏན་གྱིས་ནི་ཏིང་འཛིན་འདི་རྙེད་དེ།
en: “This samādhi is attained through practicing.

source: །ནན་ཏན་དག་ཀྱང་རྣམ་པ་མང་དུ་གསུངས།
en: Its practice has been taught in many forms.

source: །ཡོན་ཏན་ཀུན་ལ་རབ་ཏུ་གནས་པ་དག །དེ་ལ་ཏིང་འཛིན་འདི་ནི་རྙེད་མི་དཀའ།
en: This samādhi is not difficult to attain For those who are established in all good qualities. {16} “This samādhi is not difficult to attain

source: །བྲོ་བ་དག་ལ་མ་ཞེན་མི་བསྐམ་ཞིང་།
en: For those who do not grasp pleasures, who have no cravings,

source: །ཁྱིམ་རྣམས་ལ་ཡང་མ་ཆགས་ཕྲག་དོག་མེད།
en: Who have no attachment to family, and are without envy,

source: །བྱམས་ལ་གནས་ཤིང་ཁྲོ་བ་མེད་པ་གང་།
en: Who are continually kind, and are without anger. {17}

source: །དེ་ལ་ཏིང་འཛིན་འདི་ནི་རྙེད་མི་དཀའ།
en: “This samādhi is not difficult to attain

source: །རྙེད་དང་བཀུར་སྟི་དག་ཀྱང་མི་འདོད་ཅིང་།
en: For those who do not desire honor or gain,

source: །འཚོ་བ་གཙང་ཞིང་ཅི་ཡང་མི་འཆང་བ།
en: Whose subsistence is pure, who have nothing,

source: །ཚུལ་ཁྲིམས་རྣམ་པར་དག་ཅིང་འཇིགས་མེད་པ།
en: Whose conduct is pure, and who are without fear. {18}

source: །གཡེལ་བ་མེད་ཅིང་བརྩོན་འགྲུས་བརྩམས་པ་དང་། །དགོན་པར་གནས་ཤིང་སྦྱངས་ལ་གནས་གྱུར་དང་། །བདག་མེད་བཟོད་པ་ལ་ཡང་རབ་གནས་པ།
en: For those who are diligent, without lassitude, And who are inclined to solitude, established in purification, And continually remain in the patience of selflessness. {19}

source: །རྒོད་པ་མེད་ཅིང་ཤིན་ཏུ་དུལ་བའི་སེམས།
en: For those who are not agitated, who have a well-tamed mind,

source: །སྤྱོད་དང་སྤྱོད་ལམ་དག་ལ་རབ་ཏུ་གནས།
en: Who remain within the conduct of mendicants and bodhisattvas,

source: །གཏོང་ལ་མོས་ཤིང་སེར་སྣ་མེད་པ་དག །དེ་ལ་ཏིང་འཛིན་འདི་ནི་རྙེད་མི་དཀའ། །ཏིང་འཛིན་ཞི་བ་འདི་ནི་གང་འཛིན་པ།
en: And who are predisposed toward generosity and are without miserliness. {20}

source: །དེ་ལ་དཔེ་བྱད་བཟང་དང་མཚན་རྣམས་དང་། །འདྲེན་པས་སངས་རྒྱས་ཆོས་ནི་བཅྭ་བརྒྱད་དང་། །སྟོབས་དང་མི་འཇིགས་གང་བརྗོད་རྙེད་མི་དཀའ།
en: “The primary and secondary signs, the eighteen qualities of a buddha, The strengths, and the fearlessnesses that have been described by the Guide Will not be difficult to attain for one Who maintains this samādhi of peace. {21}

source: །སངས་རྒྱས་སྤྱན་གྱིས་གཟིགས་པའི་སེམས་ཅན་གང་།
en: “If all the beings that a buddha can see

source: །དེ་དག་དུས་གཅིག་སངས་རྒྱས་ཉིད་གྱུར་ལ།
en: Were simultaneously to attain buddhahood,

source: །དེ་རྣམས་རེ་རེའི་ཚེ་ཡི་ཚད་ཀྱང་ནི།
en: And the length of each of their lives

source: །བསྐལ་པ་བྱེ་བ་སྟོང་ཕྲག་བསམ་མི་ཁྱབ།
en: Were to be countless tens of thousands of millions of eons, {22}

source: །དེ་དག་རེ་རེ་ལ་ཡང་མགོ་བོ་ནི།
en: “And if each of them were to have heads

source: །རྒྱ་མཚོ་ཀུན་གྱི་བྱེ་མ་དེ་སྙེད་ཡོད།
en: As numerous as the grains of sand in the ocean,

source: །མགོ་བོ་ཇི་སྙེད་ཡོད་པ་ཐམས་ཅད་ལ།
en: And if within each head there were tongues

source: །དེ་སྙེད་ལྕེ་ཡང་མགོ་བོ་ཀུན་ལ་ཡོད།
en: As numerous as the number of heads, {23}

source: །དེ་དག་ཀུན་གྱིས་ཏིང་འཛིན་འདི་ལས་གང་།
en: “And if all their voices were to describe the benefit

source: །ཚིགས་བཅད་འཛིན་འདིའི་ཕན་ཡོན་བརྗོད་ཀྱང་ནི།
en: Of possessing one verse from this samādhi,

source: །ཅུང་ཟད་ཡོངས་སུ་བརྗོད་པར་མི་འགྱུར་ན།
en: They would not be able to describe even a fraction of it,

source: །གང་གིས་བསླབས་ཤིང་གཟུང་བ་ཅི་ཞིག་སྨོས། །ཏིང་འཛིན་བལྟ་དཀའ་ཞི་བ་གང་འཛིན་པ།
en: Let alone describe the benefit of studying it, or of possessing it. {24}

source: །སྦྱངས་པའི་ཡོན་ཏན་བླངས་ཤིང་སྤྱོད་པ་དག །དེ་ལ་ལྷ་དང་ལྷ་མིན་གནོད་སྦྱིན་སྨོན།
en: “Whoever has accomplished the practice and developed qualities Will be adored by devas, asuras, and yakṣas. The ones who maintain the samādhi of peace, difficult to attain,

source: །རྒྱལ་པོ་དག་ཀྱང་ཕྱི་བཞིན་འབྲང་བར་བྱེད།
en: Will have kings as their attendants. {25}

source: །ཏིང་འཛིན་ཞི་བ་རྙེད་དཀའ་གང་འཛིན་པ།
en: “The ones who maintain the samādhi of peace that is difficult to attain

source: །རྒྱལ་བ་དག་གིས་ཡོངས་སུ་གཟུང་བར་འགྱུར།
en: Will be in the care of the jinas.

source: །ལྷ་དང་ཀླུ་རྣམས་རྟག་ཏུ་རྗེས་སུ་འབྲང་།
en: They will always be attended by devas and nāgas

source: །ཕས་ཀྱི་རྒོལ་བས་དེ་ཡི་གཟི་མི་བཟོད།
en: And opponents will not be able to withstand their brilliance. {26}

source: །ཏིང་འཛིན་ཞི་བ་འདི་ནི་གང་འཛིན་པ།
en: “The ones who maintain the samādhi of peace

source: །དེ་ཡི་སྤོབས་པ་དག་ནི་མཐའ་ཡས་འགྱུར།
en: Will have infinite eloquence.

source: །མདོ་སྡེ་དག་ནི་སྟོང་རྣམས་རབ་སྟོན་ཀྱང་།
en: They will teach countless thousands of sūtras

source: །དེ་ལ་ནམ་ཡང་རྒྱུན་ནི་འཆད་མི་འགྱུར།
en: Without the slightest interval. {27}

source: །གང་རྣམས་མི་བཟད་ཆེན་པོའི་ཕྱི་དུས་ན།
en: “Those in the future time of great terrors

source: །ཏིང་ངེ་འཛིན་འདི་ཐོས་ནས་འཛིན་པ་རྣམས།
en: Who hear this samādhi and keep it

source: །སངས་རྒྱས་འདྲེན་པ་སྣང་བ་དཔག་མེད་དང་། །བདེ་ལྡན་འཇིག་རྟེན་ཁམས་ཀྱང་མཐོང་བར་འགྱུར།
en: Will see the guide, Buddha Amitābha, And also the realm of Sukhāvatī. {28}

source: །ཕན་ཡོན་འདི་དག་རབ་ཏུ་བསྟན་མཛད་ནས།
en: “I have revealed these benefits

source: །ཡོངས་སུ་མྱ་ངན་ང་འདས་ཕྱི་མའི་ཚེ།
en: And I, the self-arisen Teacher, request

source: །ཏིང་འཛིན་རྣམ་པར་དག་པ་འདི་ཟུང་ཞེས།
en: That you uphold this pure samādhi

source: །རང་བྱུང་སྟོན་པ་བདག་ཉིད་གསོལ་བ་འདེབས།
en: In the time after I have passed into nirvāṇa. {29}

source: །ཡོངས་སུ་མྱ་ངན་གང་འདས་སངས་རྒྱས་དང་། །གང་རྣམས་མ་བྱོན་ད་ལྟར་བྱུང་བ་ཡི།
en: “The buddhas who have passed into nirvāṇa, Those who will come in the future and those who have appeared now,

source: །རྒྱལ་བ་ཐམས་ཅད་ཏིང་འཛིན་འདི་བསླབས་ནས། །བྱང་ཆུབ་རྡུལ་བྲལ་འདུས་མ་བྱས་པ་རྟོགས།
en: All those jinas realize unstained, noncomposite enlightenment Through the practice of this samādhi.” {30}

source: །སཱ་ལའི་དབང་པོའི་རྒྱལ་པོའི་ལེའུ་སྟེ་གཉིས་པའོ།། །།དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། །གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བརྗོད་པ་ཡང་དག་པར་བསྟན་པ་དང་། དོན་དང་འབྲུ་ཡོངས་སུ་མི་ཟད་པར་བྱ་བ་དང་བདག་གི་ཚིག་ཐམས་ཅད་སངས་རྒྱས་ཀྱིས་ཡོངས་སུ་གཟུང་ཞིང་འབྱུང་བར་འདོད་ན། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་ཏིང་ངེ་འཛིན་འདི་གཟུང་བར་བྱ། །ཀུན་ཆུབ་པར་བྱ། བཅང་བར་བྱ། བཀླག་པར་བྱ། རབ་ཏུ་གདོན་པར་བྱ། ལུང་མནོད་པར་བྱ།
en: Conclusion of the second chapter, “Śālendrarāja.” Praise of the Buddha’s Qualities Chapter 3 Then the Bhagavān said to the youth Candraprabha, “Young man, therefore, if bodhisattva mahāsattvas wish to teach the buddha qualities as described by the Tathāgata, the arhat, the perfectly enlightened Buddha, without any loss of meaning or words, and for all their words to come forth as those of the Buddha, then those bodhisattva mahāsattvas, young man, should, for the sake of all beings, obtain this samādhi, understand it, preserve it, recite it to others, promote it, proclaim it, chant it, meditate on it with unadulterated meditation, promulgate it, and make it widely known to others.

source: ཁ་ཏོན་དུ་བྱ། ཉོན་མོངས་པ་མེད་པའི་སྒོམ་པས་བསྒོམ་པར་བྱ། མང་དུ་བྱ་གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པར་བྱའོ། །གཞོན་ནུ་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཡང་དག་པ་གང་ཡིན་ཞེ་ན།
en: “Young man, what are the buddha qualities of a tathāgata?

source: གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགོན་པ་ན་འདུག་ཀྱང་རུང་། ཤིང་དྲུང་ན་འདུག་ཀྱང་རུང་། བླ་གབ་མེད་པ་ན་འདུག་ཀྱང་རུང་། ཁྱིམ་སྟོང་པ་ན་འདུག་ཀྱང་རུང་འདི་ལ་ཡང་དག་པར་སློབ་སྟེ། འདི་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: “Young man, bodhisattva mahāsattvas, whether in solitude, at the foot of a tree, in the open air, or in an empty building, should learn well the following. “The Bhagavān is thus:

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ནི་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སོ།
en: a tathāgata, an arhat, a fully enlightened buddha, one with perfect wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavān.

source: །དེ་བཞིན་གཤེགས་པ་དེ་ནི་བསོད་ནམས་དག་གི་རྒྱུ་འཐུན་པ།
en: “The Tathāgata is the natural result of merit.

source: དགེ་བའི་རྩ་བ་རྣམས་ཆུད་མི་ཟ་བ།
en: He is the inevitable result of roots of merit.

source: བཟོད་པས་བརྒྱན་པ།
en: He is adorned by patience.

source: བསོད་ནམས་ཀྱི་གཏེར་རྣམས་ཀྱི་གཞི།
en: He is the manifestation of a treasure of merit.

source: དཔེ་བྱད་བཟང་པོ་རྣམས་ཀྱིས་སྤྲས་པ།
en: He is beautified by the excellent primary signs of a great being.

source: མཚན་གྱི་མེ་ཏོག་རྒྱས་པ།
en: He has the blossomed flowers of the secondary signs of a great being.

source: སྤྱོད་ཡུལ་རན་པར་འཐུན་པ།
en: He is exemplary in his conduct.

source: མཐོང་ན་མི་འཐུན་པ་མེད་པ།
en: His appearance is never disagreeable.

source: དད་པས་མོས་པ་རྣམས་མངོན་པར་དགའ་བ།
en: He brings joy to those motivated by faith.

source: ཤེས་རབ་ཟིལ་གྱིས་མི་ནོན་པ།
en: He is invincible in his wisdom.

source: སྟོབས་རྣམས་ལ་རྫི་བ་མེད་པ།
en: He has the invulnerability of the strengths.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྟོན་པ།
en: He is the teacher of all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡབ།
en: He is the father of all bodhisattvas.

source: འཕགས་པའི་གང་ཟག་རྣམས་ཀྱི་རྒྱལ་པོ་ལས་དང་པོ་པ་རྣམས་ཀྱི་དེད་དཔོན།
en: He is the king of all noble individuals. He is the caravan leader for those beginning on their journey.

source: ཡེ་ཤེས་དཔག་ཏུ་མེད་པ།
en: He is immeasurable in his wisdom.

source: སྤོབས་པ་བསམ་གྱིས་མི་ཁྱབ་པ།
en: He is inconceivable in his eloquence.

source: གསུང་རྣམ་པར་དག་པ། དབྱངས་སྙན་པ།
en: He is pure in his voice. He is delightful in his speech.

source: སྐུ་བྱད་བལྟ་བས་ཆོག་མི་ཤེས་པ།
en: He is lovely in his physical form.

source: སྐུ་མཚུངས་པ་མེད་པ།
en: He is unequaled in body.

source: འདོད་པ་དག་གིས་མ་གོས་པ།
en: He is unstained by the desire realm.

source: གཟུགས་དག་གིས་ཉེ་བར་མ་གོས་པ།
en: He is unsullied by the form realm.

source: གཟུགས་མེད་པ་དག་དང་མ་འདྲེས་པ།
en: He is unadulterated by the formless realm.

source: ཕུང་པོ་དག་ལས་རབ་ཏུ་རྣམ་པར་གྲོལ་བ།
en: He is free from suffering. He is liberated from the skandhas.

source: ཁམས་རྣམས་དང་མི་ལྡན་པ།
en: He is separated from the dhātus.

source: སྐྱེ་མཆེད་རྣམས་བསྡམས་པ།
en: He has restrained the āyatanas.

source: མདུད་པ་རྣམས་ཤིན་ཏུ་བཅད་པ། ཡོངས་སུ་གདུང་བ་དག་ལས་རྣམ་པར་གྲོལ་བ། སྲིད་པ་ལས་ཡོངས་སུ་གྲོལ་བ། ཆུ་བོ་ལས་རྒལ་བ།
en: He has cut through the knots. He is free from torment. He is released from craving. He has crossed over the great river.

source: ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པ།
en: He is complete in his wisdom.

source: འདས་པ་དང་མ་བྱོན་པ་དང་ད་ལྟར་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་ལ་གནས་པ།
en: He is established in the wisdom of the buddha bhagavāns of the past, future, and present.

source: མྱ་ངན་ལས་འདས་པ་ལ་མི་གནས་པ།
en: He does not remain in nirvāṇa.

source: ཡང་དག་པ་ཉིད་ཀྱི་མཐའ་ལ་གནས་པ།
en: He resides at the summit of existence.

source: སེམས་ཅན་ཐམས་ཅད་ལ་གཟིགས་པའི་ས་ལ་བཞུགས་པ་སྟེ།
en: He is on the level of seeing all beings.

source: གཞོན་ནུ་འདི་དག་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཡང་དག་པ་སྟེ།
en: Young man, those are the buddha qualities of a tathāgata.
